## Pandas-DataFrame and Series

Pandas is a powerful data manipulation library in python, widely used for data analysis and data cleaning.
It provides two primary data structures: Series and DataFrame. A series is a one-dimensional array-like object, while a DataFrame is two-dimensional,size-mutable, and potentially heterogeneous tabular data structure with labeled axes (rows and columns).

In [1]:
pip install pandas

^C
Note: you may need to restart the kernel to use updated packages.

Collecting pandas
  Downloading pandas-2.2.3-cp312-cp312-win_amd64.whl.metadata (19 kB)
Requirement already satisfied: numpy>=1.26.0 in d:\code_works\data_analytics_course_lessons\advance_python_lessons\venv\lib\site-packages (from pandas) (2.2.4)
Requirement already satisfied: python-dateutil>=2.8.2 in d:\code_works\data_analytics_course_lessons\advance_python_lessons\venv\lib\site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2025.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Downloading tzdata-2025.2-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in d:\code_works\data_analytics_course_lessons\advance_python_lessons\venv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Downloading pandas-2.2.3-cp312-cp312-win_amd64.whl (11.5 MB)
   ---------------------------------------- 0.0/11.5 MB ? eta -:--:--
   -- ------------------------------------- 0.8/11.5 MB 5.6 MB/s eta 0:00:02
   ------ --------------------------------- 1.8/11.5 MB 4.8 MB/s eta 0:00:03
   ---------- ----------------------------- 2.9/11.5 MB 4.9 MB/s eta 0:00:02
   ------------- -------------------------- 3.9/11.5 MB 4.7 MB/s eta 0:00:02
   ------------------ --------------------- 5.2/11.5 MB 4.9 MB/s eta 0:00:02
   ---------------------- ----------------- 6.6/11.5 MB 5.2 MB/s eta 0:00:01
   --------------------------- ------------ 7.9/11.5 MB 5.5 MB/s eta 0:00:01
   -------------------------------- ------- 9.4/11.5 MB 5.7 MB/s eta 0:00:01
   ----------------------------------- ---- 10.2/11.5 MB 5.4 MB/s eta 0:00:01
   ---------------------------------------  11.3/11.5 MB 5.4 MB/s eta 0:00:01
   ---------------------------------------  11.3/11.5 MB 5.4 MB/s eta 0:00:01
   ---------------------------------------  11.3/11.5 MB 5.4 MB/s eta 0:00:01
   ---------------------------------------  11.3/11.5 MB 5.4 MB/s eta 0:00:01
   ---------------------------------------  11.3/11.5 MB 5.4 MB/s eta 0:00:01
   ---------------------------------------  11.3/11.5 MB 5.4 MB/s eta 0:00:01
   ---------------------------------------  11.3/11.5 MB 5.4 MB/s eta 0:00:01
   ---------------------------------------  11.3/11.5 MB 5.4 MB/s eta 0:00:01
   ---------------------------------------  11.3/11.5 MB 5.4 MB/s eta 0:00:01
   ---------------------------------------  11.3/11.5 MB 5.4 MB/s eta 0:00:01
   ---------------------------------------  11.3/11.5 MB 5.4 MB/s eta 0:00:01
   ---------------------------------------  11.3/11.5 MB 5.4 MB/s eta 0:00:01
   ---------------------------------------  11.3/11.5 MB 5.4 MB/s eta 0:00:01
   ---------------------------------------  11.3/11.5 MB 5.4 MB/s eta 0:00:01
   ---------------------------------------  11.3/11.5 MB 5.4 MB/s eta 0:00:01
   ---------------------------------------  11.3/11.5 MB 5.4 MB/s eta 0:00:01
   ---------------------------------------  11.3/11.5 MB 5.4 MB/s eta 0:00:01
   ---------------------------------------  11.3/11.5 MB 5.4 MB/s eta 0:00:01
   ---------------------------------------  11.3/11.5 MB 5.4 MB/s eta 0:00:01
   ---------------------------------------  11.3/11.5 MB 5.4 MB/s eta 0:00:01
   ---------------------------------------  11.3/11.5 MB 5.4 MB/s eta 0:00:01
   ---------------------------------------  11.3/11.5 MB 5.4 MB/s eta 0:00:01
   ---------------------------------------  11.3/11.5 MB 5.4 MB/s eta 0:00:01
   ---------------------------------------  11.3/11.5 MB 5.4 MB/s eta 0:00:01
   ---------------------------------------  11.3/11.5 MB 5.4 MB/s eta 0:00:01
   ---------------------------------------  11.3/11.5 MB 5.4 MB/s eta 0:00:01
   ---------------------------------------  11.3/11.5 MB 5.4 MB/s eta 0:00:01
   ---------------------------------------  11.3/11.5 MB 5.4 MB/s eta 0:00:01
   ---------------------------------------  11.3/11.5 MB 5.4 MB/s eta 0:00:01
   ---------------------------------------  11.3/11.5 MB 5.4 MB/s eta 0:00:01
   ---------------------------------------  11.3/11.5 MB 5.4 MB/s eta 0:00:01
   ---------------------------------------  11.3/11.5 MB 5.4 MB/s eta 0:00:01
   ---------------------------------------  11.3/11.5 MB 5.4 MB/s eta 0:00:01
   ---------------------------------------  11.3/11.5 MB 5.4 MB/s eta 0:00:01
   ---------------------------------------  11.3/11.5 MB 5.4 MB/s eta 0:00:01
   ---------------------------------------  11.3/11.5 MB 5.4 MB/s eta 0:00:01
   ---------------------------------------  11.3/11.5 MB 5.4 MB/s eta 0:00:01
   ---------------------------------------  11.3/11.5 MB 5.4 MB/s eta 0:00:01
   ---------------------------------------  11.3/11.5 MB 5.4 MB/s eta 0:00:01
   ---------------------------------------  11.3/11.5 MB 5.4 MB/s eta 0:00:01
   ---------------------------------------  11.3/11.5 MB 5.4 MB/s eta 0:00:01
   ---------------------------------------  11.3/11.5 MB 5.4 MB/s eta 0:00:01
   ---------------------------------------  11.3/11.5 MB 5.4 MB/s eta 0:00:01
   ---------------------------------------  11.3/11.5 MB 5.4 MB/s eta 0:00:01
   ---------------------------------------- 11.5/11.5 MB 981.6 kB/s eta 0:00:00
Downloading pytz-2025.2-py2.py3-none-any.whl (509 kB)
Downloading tzdata-2025.2-py2.py3-none-any.whl (347 kB)
Installing collected packages: pytz, tzdata, pandas
Successfully installed pandas-2.2.3 pytz-2025.2 tzdata-2025.2

In [1]:
import pandas as pd

In [6]:
# Series
import pandas as pd
data = [1,2,3,4,5]
series=pd.Series(data)
print("Series \n", series)
print(type(series))

Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [7]:
## Create a series from a dictionary
data={'a':1,'b':2,'c':3}
series_dict = pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [ ]:
data = [10,20,30]
index = ['a','b','c']
pd.Series(data,index = index)

a    10
b    20
c    30
dtype: int64

In [3]:
## DataFrame 
# Create a DataFrame from a dictionary of list

data = {
    'Name':['Charis','Dede','Barbara','Jessica'],
    'Age':[25,30,45,21],
    'City':['Accra','Kumasi','Texas','Dansoman']
}
df = pd.DataFrame(data)
print(df)
print(type(df))

      Name  Age      City
0   Charis   25     Accra
1     Dede   30    Kumasi
2  Barbara   45     Texas
3  Jessica   21  Dansoman
<class 'pandas.core.frame.DataFrame'>

In [4]:
import numpy as np
np.array(df)

array([['Charis', 25, 'Accra'],
       ['Dede', 30, 'Kumasi'],
       ['Barbara', 45, 'Texas'],
       ['Jessica', 21, 'Dansoman']], dtype=object)

In [7]:
# Create a data frame from a list of Ditionaries

data = [
    {'Name':'Charis','Age':21,'City':'Accra'},
    {'Name':'Dede','Age':20,'City':'Teshie'},
    {'Name':'Jessy','Age':17,'City':'Kasoa'},
    {'Name':'Drand','Age':22,'City':'spain'}
]
df = pd.DataFrame(data)
print(df)
print(type(df))

     Name  Age    City
0  Charis   21   Accra
1    Dede   20  Teshie
2   Jessy   17   Kasoa
3   Drand   22   spain
<class 'pandas.core.frame.DataFrame'>

In [8]:
df = pd.read_csv('data.csv')
print(df.head(5))

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [9]:
df.tail(5)

          Date Category  Value   Product  Sales Region
45  2023-02-15        B   99.0  Product2  599.0   West
46  2023-02-16        B    6.0  Product1  938.0  South
47  2023-02-17        B   69.0  Product3  143.0   West
48  2023-02-18        C   65.0  Product3  182.0  North
49  2023-02-19        C   11.0  Product3  708.0  North

In [10]:
# Accessing Data from dataframe
data

[{'Name': 'Charis', 'Age': 21, 'City': 'Accra'},
 {'Name': 'Dede', 'Age': 20, 'City': 'Teshie'},
 {'Name': 'Jessy', 'Age': 17, 'City': 'Kasoa'},
 {'Name': 'Drand', 'Age': 22, 'City': 'spain'}]

In [11]:
df

          Date Category  Value   Product  Sales Region
0   2023-01-01        A   28.0  Product1  754.0   East
1   2023-01-02        B   39.0  Product3  110.0  North
2   2023-01-03        C   32.0  Product2  398.0   East
3   2023-01-04        B    8.0  Product1  522.0   East
4   2023-01-05        B   26.0  Product3  869.0  North
5   2023-01-06        B   54.0  Product3  192.0   West
6   2023-01-07        A   16.0  Product1  936.0   East
7   2023-01-08        C   89.0  Product1  488.0   West
8   2023-01-09        C   37.0  Product3  772.0   West
9   2023-01-10        A   22.0  Product2  834.0   West
10  2023-01-11        B    7.0  Product1  842.0  North
11  2023-01-12        B   60.0  Product2    NaN   West
12  2023-01-13        A   70.0  Product3  628.0  South
13  2023-01-14        A   69.0  Product1  423.0   East
14  2023-01-15        A   47.0  Product2  893.0   West
15  2023-01-16        C    NaN  Product1  895.0  North
16  2023-01-17        C   93.0  Product2  511.0  South
17  2023-01-18        C    NaN  Product1  108.0   West
18  2023-01-19        A   31.0  Product2  578.0   West
19  2023-01-20        A   59.0  Product1  736.0   East
20  2023-01-21        C   82.0  Product3  606.0  South
21  2023-01-22        C   37.0  Product2  992.0  South
22  2023-01-23        B   62.0  Product3  942.0  North
23  2023-01-24        C   92.0  Product2  342.0   West
24  2023-01-25        A   24.0  Product2  458.0   East
25  2023-01-26        C   95.0  Product1  584.0   West
26  2023-01-27        C   71.0  Product2  619.0  North
27  2023-01-28        C   56.0  Product2  224.0  North
28  2023-01-29        B    NaN  Product3  617.0  North
29  2023-01-30        C   51.0  Product2  737.0  South
30  2023-01-31        B   50.0  Product3  735.0   West
31  2023-02-01        A   17.0  Product2  189.0   West
32  2023-02-02        B   63.0  Product3  338.0  South
33  2023-02-03        C   27.0  Product3    NaN   East
34  2023-02-04        C   70.0  Product3  669.0   West
35  2023-02-05        B   60.0  Product2    NaN   West
36  2023-02-06        C   36.0  Product3  177.0   East
37  2023-02-07        C    2.0  Product1    NaN  North
38  2023-02-08        C   94.0  Product1  408.0  South
39  2023-02-09        A   62.0  Product1  155.0   West
40  2023-02-10        B   15.0  Product1  578.0   East
41  2023-02-11        C   97.0  Product1  256.0   East
42  2023-02-12        A   93.0  Product3  164.0   West
43  2023-02-13        A   43.0  Product3  949.0   East
44  2023-02-14        A   96.0  Product3  830.0   East
45  2023-02-15        B   99.0  Product2  599.0   West
46  2023-02-16        B    6.0  Product1  938.0  South
47  2023-02-17        B   69.0  Product3  143.0   West
48  2023-02-18        C   65.0  Product3  182.0  North
49  2023-02-19        C   11.0  Product3  708.0  North

In [40]:
df = pd.DataFrame(data)
df

     Name  Age    City
0  Charis   21   Accra
1    Dede   20  Teshie
2   Jessy   17   Kasoa
3   Drand   22   spain

In [15]:
type(df['Name'])

pandas.core.series.Series

In [18]:
print(df.loc[0])

Name    Charis
Age         21
City     Accra
Name: 0, dtype: object

In [19]:
df.iloc[0]

Name    Charis
Age         21
City     Accra
Name: 0, dtype: object

In [20]:
df.loc[0][0]

C:\Users\theop\AppData\Local\Temp\ipykernel_20100\2527876973.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[0][0]

'Charis'

In [25]:
df.iloc[0][2]

C:\Users\theop\AppData\Local\Temp\ipykernel_20100\2519637664.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][2]

'Accra'

In [26]:
## Accesing specified element
df['Name']

0    Charis
1      Dede
2     Jessy
3     Drand
Name: Name, dtype: object

In [27]:
df

     Name  Age    City
0  Charis   21   Accra
1    Dede   20  Teshie
2   Jessy   17   Kasoa
3   Drand   22   spain

In [29]:
df.at[3,'Age']

np.int64(22)

In [32]:
df.at[3,'Name']

'Drand'

In [33]:
# Accessing a specified element using iat

df.iat[2,2]

'Kasoa'

In [34]:
# Data manipulation with dataFrame
df

     Name  Age    City
0  Charis   21   Accra
1    Dede   20  Teshie
2   Jessy   17   Kasoa
3   Drand   22   spain

In [64]:
df['Salary'] = [19000,18000,17000,14000]
df

     Name  Age    City  Salary
0  Charis   21   Accra   19000
1    Dede   20  Teshie   18000
2   Jessy   17   Kasoa   17000
3   Drand   22   spain   14000

In [65]:
# Remove a column
df.drop('Salary', axis = 1,inplace=True)
df

     Name  Age    City
0  Charis   21   Accra
1    Dede   20  Teshie
2   Jessy   17   Kasoa
3   Drand   22   spain

In [69]:
df['Salary'] = [22000,18400,16000,15000]
df

     Name  Age    City  Salary
0  Charis   21   Accra   22000
1    Dede   20  Teshie   18400
2   Jessy   17   Kasoa   16000
3   Drand   22   spain   15000

In [70]:
df

     Name  Age    City  Salary
0  Charis   21   Accra   22000
1    Dede   20  Teshie   18400
2   Jessy   17   Kasoa   16000
3   Drand   22   spain   15000

In [71]:
import pandas as pd
df.drop('Salary',axis=1,inplace=True)
print(df)

     Name  Age    City
0  Charis   21   Accra
1    Dede   20  Teshie
2   Jessy   17   Kasoa
3   Drand   22   spain

In [72]:
# Add age to the column
df['Age']=df['Age']+1

In [73]:
df

     Name  Age    City
0  Charis   22   Accra
1    Dede   21  Teshie
2   Jessy   18   Kasoa
3   Drand   23   spain

In [74]:
df.drop(0)

    Name  Age    City
1   Dede   21  Teshie
2  Jessy   18   Kasoa
3  Drand   23   spain

In [75]:
df

     Name  Age    City
0  Charis   22   Accra
1    Dede   21  Teshie
2   Jessy   18   Kasoa
3   Drand   23   spain

In [76]:
df.drop(0,inplace=True)

In [77]:
df

    Name  Age    City
1   Dede   21  Teshie
2  Jessy   18   Kasoa
3  Drand   23   spain

In [78]:
df.head

<bound method NDFrame.head of     Name  Age    City
1   Dede   21  Teshie
2  Jessy   18   Kasoa
3  Drand   23   spain>

In [79]:
df = pd.read_csv('data.csv')
print(df.head(5))

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [80]:
# Display the data types of each column
print('Data types: \n',df.dtypes)

# Describing the DataFrame
print('Statistical summary:\n',df.describe())

# Group by a column and perform an aggregation
grouped = df.groupby('Category')['Value'].mean()
print('Mean value by category: \n',grouped)

Data types:
 Date         object
Category     object
Value       float64
Product      object
Sales       float64
Region       object
dtype: object
Statistical summary:
            Value       Sales
count  47.000000   46.000000
mean   51.744681  557.130435
std    29.050532  274.598584
min     2.000000  108.000000
25%    27.500000  339.000000
50%    54.000000  591.500000
75%    70.000000  767.500000
max    99.000000  992.000000
Mean value by category:
 Category
A    48.357143
B    44.142857
C    59.842105
Name: Value, dtype: float64